<?php

return [
    //login
    'logout' => 'تسجيل خروج',
    'sign-in' => 'تسجيل دخول',
    'sign-in-text' => 'يرجى إدخال بياناتك لتسجيل الدخول',
    'email-address' => 'البريد الإلكتروني',
    'password' => 'كلمة المرور',
    'remember-me' => 'تذكرني',
    'forgot-password' => 'نسيت كلمة المرور ؟',
    'copyright' => 'مركز الرجاء المسيحي - إدارة الموارد البشرية',
    'failed' => 'بيانات الدخول غير صحيحة',

    //reset-password
    'reset-password'=> 'إعادة تعيين كلمة المرور',
    'reset-password-text' => 'يجب أن تكون كلمة المرور الجديدة مختلفة عن كلمات المرور المستخدمة سابقًا.',
    'password-text' => 'استخدم 8 أحرف أو أكثر مع مزيج من الأحرف والأرقام والرموز.',
    'confirm-password' => 'إعادة إدخال كلمة المرور',
    'confirm' => 'تأكيد',

    //forgot-password
    'forgot-password-text' => 'إذا نسيت كلمة المرور الخاصة بك، فسنرسل لك تعليمات عبر البريد الإلكتروني لإعادة تعيينها',
    'submit' => 'إرسال',

];











