<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'failed' => 'بيانات الاعتماد هذه لا تتطابق مع سجلاتنا.',
    'password' => 'كلمة المرور المقدمة غير صحيحة.',
    'throttle' => 'محاولات تسجيل الدخول كثيرة جدًا. يرجى المحاولة مرة أخرى خلال :sec ثانية.',

    'inputs' => [
        'remember-me' => 'تذكرني',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'password-input' => 'ادخل كلمة المرور',
        'forget-password' => 'نسيت كلمة المرور؟',
        'password_confirmation' =>'تأكيد كلمة المرور',
        'reset-link' =>'رابط إعادة تعيين كلمةالمرور.',
        'old-password' => 'كلمة المرور الحالية',
        'new-password' => 'كلمة المرور الجديدة',
        'read-and-understood' => 'لقد قرأت وفهمت وأوافق على '




    ],
    'buttons' => [
        'sing-in' => 'تسجيل دخول',
        'sign-out' => 'تسجيل خروج',
        'login' => 'تسجيل دخول ',
        'registered' => 'لدي حساب بالفعل!',
        'register' => 'تسجيل',
        'reset-password' => 'أعد تعيين كلمة المرور',
        'resend-email' => 'إعادة ارسال بريد التحقق',
        'confirm' => 'تأكيد'
    ],
    'messages' => [
        'register-as' => 'سجل ك:role',
        'dont-have-account' => 'لا تمتلك حساب؟ قم بالتسجيل هنا كـ',
        'inactive' => 'الحساب غير مفعًل',
        'cms-welcome' => 'مرحبا بك في إدارة منصة شاغر,<br> قم بتسجيل الدخول من فضلك',
        'greeting' => 'مرحباً! :name',
        'confirm-password' => 'هذه منطقة آمنة للتطبيق. الرجاء تأكيد كلمة المرور الخاصة بك قبل المتابعة.',
        'check-verify-email' => 'شكرا لتسجيلك! قبل البدء، هل يمكنك التحقق من عنوان بريدك الإلكتروني عن طريق النقر على الرابط الذي أرسلناه إليك للتو عبر البريد الإلكتروني؟ إذا لم تتلق رسالة البريد الإلكتروني، فسنرسل لك بريدًا آخر بكل سرور.',
        'email-verify-sent' => 'تم إرسال رابط تحقق جديد إلى عنوان البريد الإلكتروني الذي قدمته أثناء التسجيل.',
        'forget-password' => 'نسيت كلمة السر؟ لا مشكلة. فقط أخبرنا بعنوان بريدك الإلكتروني وسنرسل إليك عبر البريد الإلكتروني رابط إعادة تعيين كلمة المرور الذي سيسمح لك باختيار كلمة مرور جديدة.',
        'success-register' => [
            'title' => 'تم تقديم تسجيلك بنجاح',
            'content' => 'يرجى تأكيد بريدك الإلكتروني بالنقر على الرابط المرسل إلى عنوان بريدك الإلكتروني. إذا لم تتلق رسالة التأكيد، يرجى التحقق من صندوق البريد العشوائي/الغير هام.'
        ]

],










];
